<a href="https://colab.research.google.com/github/daawonn/R_project/blob/master/2_R%EC%9D%84_%EC%9D%B4%EC%9A%A9%ED%95%9C_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EA%B0%80%EA%B3%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## R에서 사용하는 기호들

In [1]:
library(dplyr)
exam <- read.csv('/content/csv_exam.csv')
exam

Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   5 2     25   80      65
6   6 2     50   89      98
7   7 2     80   90      45
8   8 2     90   78      25
9   9 3     20   98      15
10 10 3     50   98      45
11 11 3     65   65      65
12 12 3     45   85      32
13 13 4     46   98      65
14 14 4     48   87      12
15 15 4     75   56      78
16 16 4     58   98      65
17 17 5     65   68      98
18 18 5     80   78      90
19 19 5     89   68      87
20 20 5     78   83      58

In [2]:
# exam 에서 class 가 1 인 경우만 추출하여 출력
exam %>% filter(class == 1)

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60
3 3  1     45   86      78
4 4  1     30   98      58

- [참고] 단축키 [Ctrl+Shit+M]으로 %>% 기호 입력

In [3]:
# 2반인 경우
exam %>% filter(class == 2)

  id class math english science
1 5  2     25   80      65
2 6  2     50   89      98
3 7  2     80   90      45
4 8  2     90   78      25

In [4]:
# 1반이 아닌 경우
exam %>% filter(class != 1)

   id class math english science
1   5 2     25   80      65
2   6 2     50   89      98
3   7 2     80   90      45
4   8 2     90   78      25
5   9 3     20   98      15
6  10 3     50   98      45
7  11 3     65   65      65
8  12 3     45   85      32
9  13 4     46   98      65
10 14 4     48   87      12
11 15 4     75   56      78
12 16 4     58   98      65
13 17 5     65   68      98
14 18 5     80   78      90
15 19 5     89   68      87
16 20 5     78   83      58

In [5]:
# 3 반이 아닌 경우
exam %>% filter(class != 3)

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   5 2     25   80      65
6   6 2     50   89      98
7   7 2     80   90      45
8   8 2     90   78      25
9  13 4     46   98      65
10 14 4     48   87      12
11 15 4     75   56      78
12 16 4     58   98      65
13 17 5     65   68      98
14 18 5     80   78      90
15 19 5     89   68      87
16 20 5     78   83      58

- 초과, 미만, 이상, 이하 조건 걸기

In [6]:
# 수학 점수가 50 점을 초과한 경우
exam %>% filter(math > 50)

   id class math english science
1   2 1     60   97      60
2   7 2     80   90      45
3   8 2     90   78      25
4  11 3     65   65      65
5  15 4     75   56      78
6  16 4     58   98      65
7  17 5     65   68      98
8  18 5     80   78      90
9  19 5     89   68      87
10 20 5     78   83      58

In [7]:
# 1 반 이면서 수학 점수가 50 점 이상인 경우
exam %>% filter(class == 1 & math >= 50)

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60

In [8]:
# 2 반 이면서 영어점수가 80 점 이상인 경우
exam %>% filter(class == 2 & english >= 80)

  id class math english science
1 5  2     25   80      65
2 6  2     50   89      98
3 7  2     80   90      45

- 여러 조건 중 하나 이상 충족하는 행 추출하기

In [9]:
# 수학 점수가 90 점 이상이거나 영어점수가 90 점 이상인 경우
exam %>% filter(math >= 90 | english >= 90)

  id class math english science
1  1 1     50   98      50
2  2 1     60   97      60
3  4 1     30   98      58
4  7 2     80   90      45
5  8 2     90   78      25
6  9 3     20   98      15
7 10 3     50   98      45
8 13 4     46   98      65
9 16 4     58   98      65

In [10]:
# 영어점수가 90 점 미만이거나 과학점수가 50 점 미만인 경우
exam %>% filter(english < 90 | science < 50)

   id class math english science
1   3 1     45   86      78
2   5 2     25   80      65
3   6 2     50   89      98
4   7 2     80   90      45
5   8 2     90   78      25
6   9 3     20   98      15
7  10 3     50   98      45
8  11 3     65   65      65
9  12 3     45   85      32
10 14 4     48   87      12
11 15 4     75   56      78
12 17 5     65   68      98
13 18 5     80   78      90
14 19 5     89   68      87
15 20 5     78   83      58

- 목록에 해당되는 행 추출하기

In [11]:
# 1, 3, 5 반에 해당되면 추출
exam %>% filter(class == 1 | class == 3 | class == 5)

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   9 3     20   98      15
6  10 3     50   98      45
7  11 3     65   65      65
8  12 3     45   85      32
9  17 5     65   68      98
10 18 5     80   78      90
11 19 5     89   68      87
12 20 5     78   83      58

- %in% 기호 이용하기

In [12]:
exam %>% filter(class %in% c(1,3,5))

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   9 3     20   98      15
6  10 3     50   98      45
7  11 3     65   65      65
8  12 3     45   85      32
9  17 5     65   68      98
10 18 5     80   78      90
11 19 5     89   68      87
12 20 5     78   83      58

In [0]:
class1 <- exam %>% filter(class == 1)  # class 가 1 인 행 추출 , class1 에 할당
class2 <- exam %>% filter(class == 2)  # class 가 2 인 행 추출 , class2 에 할당

In [14]:
mean(class1$math) # 1 반 수학 점수 평균 구하기
mean(class2$math) # 2 반 수학 점수 평균 구하기

[1] 46.25

[1] 61.25

## 혼자서 해보기 (1)
mpg 데이터를 이용해 분석 문제를 해결해 보세요.

In [15]:
mpg <- as.data.frame(ggplot2::mpg)
library(ggplot2)

Attaching package: ‘ggplot2’


The following object is masked _by_ ‘.GlobalEnv’:

    mpg

In [16]:
summary(mpg)

 manufacturer          model               displ            year
 Length:234         Length:234         Min.   :1.600   Min.   :1999
 Class :character   Class :character   1st Qu.:2.400   1st Qu.:1999
 Mode  :character   Mode  :character   Median :3.300   Median :2004
                                       Mean   :3.472   Mean   :2004
                                       3rd Qu.:4.600   3rd Qu.:2008
                                       Max.   :7.000   Max.   :2008
      cyl           trans               drv                 cty
 Min.   :4.000   Length:234         Length:234         Min.   : 9.00
 1st Qu.:4.000   Class :character   Class :character   1st Qu.:14.00
 Median :6.000   Mode  :character   Mode  :character   Median :17.00
 Mean   :5.889                                         Mean   :16.86
 3rd Qu.:8.000                                         3rd Qu.:19.00
 Max.   :8.000                                         Max.   :35.00
      hwy             fl               class
 Min.   :12.00   Length:234         Length:234
 1st Qu.:18.00   Class :character   Class :character
 Median :24.00   Mode  :character   Mode  :character
 Mean   :23.44
 3rd Qu.:27.00
 Max.   :44.00

In [17]:
head(mpg)

  manufacturer model displ year cyl trans      drv cty hwy fl class
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact

Q1. 자동차 배기량에 따라 고속도로 연비가 다른지 알아보려고 합니다. displ(배기량)이 4 이하인 자동차와 5 이상인 자동차 중 어떤 자동차의 hwy(고속도로 연비)가 평균적으로 더 높은지 알아보세요.

In [0]:
displ1 <- mpg %>% filter(displ <= 4)
displ2 <- mpg %>% filter(displ >= 5)

In [19]:
mean(displ1$hwy) 
mean(displ2$hwy)

[1] 25.96319

[1] 18.07895

In [20]:
ifelse(mean(displ1$hwy) > mean(displ2$hwy), '배기량4','배기량5' )

[1] "배기량4"

Q2. 자동차 제조 회사에 따라 도시 연비가 다른지 알아보려고 합니다. "audi"와 "toyota" 중 어느 manufacturer(자동차 제조 회사)의 cty(도시 연비)가 평균적으로 더 높은지 알아보세요

In [0]:
audi <- mpg %>% filter(manufacturer == 'audi')
toyota <- mpg %>% filter(manufacturer == 'toyota')

In [22]:
mean(audi$cty)
mean(toyota$cty)

[1] 17.61111

[1] 18.52941

In [23]:
ifelse(mean(audi$cty) > mean(toyota$cty), 'audi','toyota' )

[1] "toyota"

Q3. "chevrolet", "ford", "honda" 자동차의 고속도로 연비 평균을 알아보려고 합니다. 이 회사들의 자동차를 추출한 뒤 hwy 전체 평균을 구해보세요.

In [24]:
ch_fo_ho <- mpg %>% filter(manufacturer %in% c("chevrolet", "ford", "honda"))
mean(ch_fo_ho$hwy)

[1] 22.50943

- 필요한 변수만 추출하기

In [25]:
# 과목 math만 추출
exam %>% select(math)

   math
1  50
2  60
3  45
4  30
5  25
6  50
7  80
8  90
9  20
10 50
11 65
12 45
13 46
14 48
15 75
16 58
17 65
18 80
19 89
20 78

In [26]:
# 여러 변수 추출하기
# class, math, english 변수 추출
exam %>% select(class, math, english)

   class math english
1  1     50   98
2  1     60   97
3  1     45   86
4  1     30   98
5  2     25   80
6  2     50   89
7  2     80   90
8  2     90   78
9  3     20   98
10 3     50   98
11 3     65   65
12 3     45   85
13 4     46   98
14 4     48   87
15 4     75   56
16 4     58   98
17 5     65   68
18 5     80   78
19 5     89   68
20 5     78   83

- 변수 제외하기 (- 연산자)

In [27]:
# math 제외
exam %>% select(-math)

   id class english science
1   1 1     98      50
2   2 1     97      60
3   3 1     86      78
4   4 1     98      58
5   5 2     80      65
6   6 2     89      98
7   7 2     90      45
8   8 2     78      25
9   9 3     98      15
10 10 3     98      45
11 11 3     65      65
12 12 3     85      32
13 13 4     98      65
14 14 4     87      12
15 15 4     56      78
16 16 4     98      65
17 17 5     68      98
18 18 5     78      90
19 19 5     68      87
20 20 5     83      58

In [28]:
# math, english 제외
exam %>% select(-math, -english)

   id class science
1   1 1     50
2   2 1     60
3   3 1     78
4   4 1     58
5   5 2     65
6   6 2     98
7   7 2     45
8   8 2     25
9   9 3     15
10 10 3     45
11 11 3     65
12 12 3     32
13 13 4     65
14 14 4     12
15 15 4     78
16 16 4     65
17 17 5     98
18 18 5     90
19 19 5     87
20 20 5     58

## dplyr 함수 조합하기

In [29]:
# class 가 1 인 행만 추출한 다음 english 추출
exam %>% filter(class == 1) %>% select(english)

  english
1 98
2 97
3 86
4 98

In [30]:
# 가독성 있게 줄 바꾸기
exam %>%   
filter(class == 1) %>%  # class 가 1 인 행 추출
select(english)         # english 추출

  english
1 98
2 97
3 86
4 98

In [31]:
# 일부만 출력하기
exam %>%   
select(id, math) %>%  # id, math 추출
head                  # 앞부분 6 행까지 추출

  id math
1 1  50
2 2  60
3 3  45
4 4  30
5 5  25
6 6  50

In [32]:
exam %>%
   select(id, math) %>%  # id, math 추출
   head(10)              # 앞부분 10 행까지 추출

   id math
1   1 50
2   2 60
3   3 45
4   4 30
5   5 25
6   6 50
7   7 80
8   8 90
9   9 20
10 10 50

## 혼자서 해보기(2)

Q1. mpg 데이터는 11 개 변수로 구성되어 있습니다. 이 중 일부만 추출해서 분석에 활용하려고 합니다. mpg 데이터에서 class(자동차 종류), cty(도시 연비) 변수를 추출해 새로운 데이터를 만드세요. 새로 만든 데이터의 일부를 출력해서 두 변수로만 구성되어 있는지 확인하세요.

In [33]:
mpg_cl_cty <- mpg %>% select(class,cty)
head(mpg_cl_cty)

  class   cty
1 compact 18
2 compact 21
3 compact 20
4 compact 21
5 compact 16
6 compact 18

Q2. 자동차 종류에 따라 도시 연비가 다른지 알아보려고 합니다. 앞에서 추출한 데이터를 이용해서 class(자동차 종류)가 "suv"인 자동차와 "compact"인 자동차 중 어떤 자동차의 cty(도시 연비)가 더 높은지 알아보세요.

In [0]:
suv_cty <- mpg_cl_cty %>% filter(class=='suv')
compact_cty <- mpg_cl_cty %>% filter(class=='compact')

In [35]:
mean(suv_cty$cty)
mean(compact_cty$cty)

[1] 13.5

[1] 20.12766

In [36]:
ifelse(mean(suv_cty$cty)>mean(compact_cty$cty),'suv 연비가 더 높음','compact 연비가 더 높음')

[1] "compact 연비가 더 높음"

- 오름차순, 내림차순으로 정렬하기

In [37]:
exam %>% arrange(math)  # math 오름차순 정렬

   id class math english science
1   9 3     20   98      15
2   5 2     25   80      65
3   4 1     30   98      58
4   3 1     45   86      78
5  12 3     45   85      32
6  13 4     46   98      65
7  14 4     48   87      12
8   1 1     50   98      50
9   6 2     50   89      98
10 10 3     50   98      45
11 16 4     58   98      65
12  2 1     60   97      60
13 11 3     65   65      65
14 17 5     65   68      98
15 15 4     75   56      78
16 20 5     78   83      58
17  7 2     80   90      45
18 18 5     80   78      90
19 19 5     89   68      87
20  8 2     90   78      25

In [38]:
exam %>% arrange(desc(math))  # math 내림차순 정렬

   id class math english science
1   8 2     90   78      25
2  19 5     89   68      87
3   7 2     80   90      45
4  18 5     80   78      90
5  20 5     78   83      58
6  15 4     75   56      78
7  11 3     65   65      65
8  17 5     65   68      98
9   2 1     60   97      60
10 16 4     58   98      65
11  1 1     50   98      50
12  6 2     50   89      98
13 10 3     50   98      45
14 14 4     48   87      12
15 13 4     46   98      65
16  3 1     45   86      78
17 12 3     45   85      32
18  4 1     30   98      58
19  5 2     25   80      65
20  9 3     20   98      15

In [39]:
# 정렬 기준 변수 여러개 지정
exam %>% arrange(class, math)  # class 및 math 오름차순 정렬

   id class math english science
1   4 1     30   98      58
2   3 1     45   86      78
3   1 1     50   98      50
4   2 1     60   97      60
5   5 2     25   80      65
6   6 2     50   89      98
7   7 2     80   90      45
8   8 2     90   78      25
9   9 3     20   98      15
10 12 3     45   85      32
11 10 3     50   98      45
12 11 3     65   65      65
13 13 4     46   98      65
14 14 4     48   87      12
15 16 4     58   98      65
16 15 4     75   56      78
17 17 5     65   68      98
18 20 5     78   83      58
19 18 5     80   78      90
20 19 5     89   68      87

## 혼자서 해보기(3)

"audi"에서 생산한 자동차 중에 어떤 자동차 모델의 hwy(고속도로 연비)가 높은지 알아보려고 합니다. "audi"에서 생산한 자동차 중 hwy가 1~5위에 해당하는 자동차의 데이터를 출력하세요.

In [40]:
mpg <- as.data.frame(ggplot2::mpg)          # mpg 데이터 불러오기
 
 
mpg %>% filter(manufacturer == "audi") %>%  # audi 추출
   arrange(desc(hwy)) %>%                    # hwy 내림차순 정렬
   head(5)                                   # 5 행까지 출력

  manufacturer model      displ year cyl trans      drv cty hwy fl class
1 audi         a4         2.0   2008 4   manual(m6) f   20  31  p  compact
2 audi         a4         2.0   2008 4   auto(av)   f   21  30  p  compact
3 audi         a4         1.8   1999 4   auto(l5)   f   18  29  p  compact
4 audi         a4         1.8   1999 4   manual(m5) f   21  29  p  compact
5 audi         a4 quattro 2.0   2008 4   manual(m6) 4   20  28  p  compact

- 파생변수 추가하기

In [41]:
exam %>%   mutate(total = math + english + science) %>%  # 총합 변수 추가
   head                                          # 일부 추출

  id class math english science total
1 1  1     50   98      50      198
2 2  1     60   97      60      217
3 3  1     45   86      78      209
4 4  1     30   98      58      186
5 5  2     25   80      65      170
6 6  2     50   89      98      237

In [42]:
# 여러 파생변수 한 번에 추가하기
exam %>%   mutate(total = math + english + science,  # 총합 변수 추가
          mean = (math + english + science)/3) %>%   # 총평균 변수 추가
   head                                              # 일부 추출

  id class math english science total mean
1 1  1     50   98      50      198   66.00000
2 2  1     60   97      60      217   72.33333
3 3  1     45   86      78      209   69.66667
4 4  1     30   98      58      186   62.00000
5 5  2     25   80      65      170   56.66667
6 6  2     50   89      98      237   79.00000

추가한 변수를 dplyr 코드에 바로 활용하기

In [43]:
# mutate()에 ifelse() 적용하기
exam %>%   mutate(test = ifelse(science >= 60, "pass", "fail")) %>%   head

  id class math english science test
1 1  1     50   98      50      fail
2 2  1     60   97      60      pass
3 3  1     45   86      78      pass
4 4  1     30   98      58      fail
5 5  2     25   80      65      pass
6 6  2     50   89      98      pass

In [44]:
exam %>%   mutate(total = math + english + science) %>%  # 총합 변수 추가
   arrange(total) %>%                            # 총합 변수 기준 정렬
   head                                          # 일부 추출

  id class math english science total
1  9 3     20   98      15      133
2 14 4     48   87      12      147
3 12 3     45   85      32      162
4  5 2     25   80      65      170
5  4 1     30   98      58      186
6  8 2     90   78      25      193

## 혼자서 해보기(4)
- mpg 데이터는 연비를 나타내는 변수가 hwy(고속도로 연비), cty(도시 연비) 두 종류로 분리되어 있습니다. 두 변수를 각각 활용하는 대신 하나의 통합 연비 변수를 만들어 분석하려고 합니다.

Q1. mpg 데이터 복사본을 만들고, cty 와 hwy 를 더한 '합산 연비 변수'를 추가하세요.

In [0]:
mpg1 <- as.data.frame(ggplot2::mpg)

Q2. 앞에서 만든 '합산 연비 변수'를 2 로 나눠 '평균 연비 변수'를 추가세요

In [0]:
mpg1 <- mpg1 %>% mutate(total_mileage = hwy + cty)

Q3. '평균 연비 변수'가 가장 높은 자동차 3 종의 데이터를 출력하세요.

In [65]:
mpg1 %>%
  mutate(total = cty + hwy, mean = total/2) %>%
  arrange(desc(mean)) %>%
  head(3)

  manufacturer model      displ year cyl trans      drv cty hwy fl class
1 volkswagen   new beetle 1.9   1999 4   manual(m5) f   35  44  d  subcompact
2 volkswagen   jetta      1.9   1999 4   manual(m5) f   33  44  d  compact
3 volkswagen   new beetle 1.9   1999 4   auto(l4)   f   29  41  d  subcompact
  total_mileage total mean
1 79            79    39.5
2 77            77    38.5
3 70            70    35.0

Q4. 1~3 번 문제를 해결할 수 있는 하나로 연결된 dplyr 구문을 만들어 출력하세요. 데이터는 복사본 대신 mpg 원본을 이용하세요

In [67]:
mpg1 %>%
  mutate(total = cty + hwy, mean = total/2) %>%
  arrange(desc(mean)) %>%
  head(3)

  manufacturer model      displ year cyl trans      drv cty hwy fl class
1 volkswagen   new beetle 1.9   1999 4   manual(m5) f   35  44  d  subcompact
2 volkswagen   jetta      1.9   1999 4   manual(m5) f   33  44  d  compact
3 volkswagen   new beetle 1.9   1999 4   auto(l4)   f   29  41  d  subcompact
  total_mileage total mean
1 79            79    39.5
2 77            77    38.5
3 70            70    35.0

- 집단별로 요약하기

In [48]:
# math 평균 산출
exam %>% summarise(mean_math = mean(math))

  mean_math
1 57.45

In [49]:
exam %>%   group_by(class) %>%        # class 별로 분리
   summarise(mean_math = mean(math))  # math 평균 산출

  class mean_math
1 1     46.25
2 2     61.25
3 3     45.00
4 4     56.75
5 5     78.00

In [50]:
exam %>%   group_by(class) %>%           # class 별로 분리
   summarise(mean_math = mean(math),     # math 평균
             sum_math = sum(math),       # math 합계
             median_math = median(math), # math 중앙값
             n = n())                    # 학생 수

  class mean_math sum_math median_math n
1 1     46.25     185      47.5        4
2 2     61.25     245      65.0        4
3 3     45.00     180      47.5        4
4 4     56.75     227      53.0        4
5 5     78.00     312      79.0        4

In [52]:
mpg %>%   group_by(manufacturer, drv) %>%      # 회사별 , 구방방식별 분리
   summarise(mean_cty = mean(cty)) %>%  # cty 평균 산출
   head(10)                             # 일부 출력

   manufacturer drv mean_cty
1  audi         4   16.81818
2  audi         f   18.85714
3  chevrolet    4   12.50000
4  chevrolet    f   18.80000
5  chevrolet    r   14.10000
6  dodge        4   12.00000
7  dodge        f   15.81818
8  ford         4   13.30769
9  ford         r   14.75000
10 honda        f   24.44444

In [53]:
mpg %>%   group_by(manufacturer) %>%    # 회사별로 분리
   filter(class == "suv") %>%           # suv 추출
   mutate(tot = (cty+hwy)/2) %>%        # 통합 연비 변수 생성
   summarise(mean_tot = mean(tot)) %>%  # 통합 연비 평균 산출
   arrange(desc(mean_tot)) %>%          # 내림차순 정렬
   head(5)                              # 1~5 위까지 출력

  manufacturer mean_tot
1 subaru       21.91667
2 toyota       16.31250
3 nissan       15.87500
4 mercury      15.62500
5 jeep         15.56250

혼자서 해보기
mpg 데이터를 이용해서 분석 문제를 해결해 보세요.

Q1. mpg 데이터의 class 는 "suv", "compact" 등 자동차를 특징에 따라 일곱 종류로 분류한 변수입니다. 어떤 차종의 연비가 높은지 비교해보려고 합니다. class 별 cty 평균을 구해보세요.

Q2. 앞 문제의 출력 결과는 class 값 알파벳 순으로 정렬되어 있습니다. 어떤 차종의 도시 연비가 높은지 쉽게 알아볼 수 있도록 cty 평균이 높은 순으로 정렬해 출력하세요.

Q3. 어떤 회사 자동차의 hwy(고속도로 연비)가 가장 높은지 알아보려고 합니다. hwy 평균이 가장 높은 회사 세 곳을 출력하세요.

Q4. 어떤 회사에서 "compact"(경차) 차종을 가장 많이 생산하는지 알아보려고 합니다. 각 회사별 "compact" 차종 수를 내림차순으로 정렬해 출력하세요.

In [0]:
# 가로 합치기
# 중간고사 데이터 생성
test1 <- data.frame(id = c(1, 2, 3, 4, 5),
  midterm = c(60, 80, 70, 90, 85)) 
 
# 기말고사 데이터 생성
test2 <- data.frame(id = c(1, 2, 3, 4, 5),
  final = c(70, 83, 65, 95, 80))

In [68]:
test1

  id midterm
1 1  60
2 2  80
3 3  70
4 4  90
5 5  85

In [69]:
test2

  id final
1 1  70
2 2  83
3 3  65
4 4  95
5 5  80

In [55]:
# id 기준으로 합치기 
total <- left_join(test1, test2, by = "id")  # id 기준으로 합쳐 total 에 할당
total                                        # total 출력

  id midterm final
1 1  60      70
2 2  80      83
3 3  70      65
4 4  90      95
5 5  85      80

In [56]:
# 다른 데이터 활용해 변수 추가하기
# 반별 담임교사 명단 생성 
name <- data.frame(class = c(1, 2, 3, 4, 5),
  teacher = c("kim", "lee", "park", "choi", "jung"))
name

  class teacher
1 1     kim
2 2     lee
3 3     park
4 4     choi
5 5     jung

In [57]:
# class 기준 합치기 
# left_join() 함수 사용
exam_new <- left_join(exam, name, by = "class") 
exam_new

   id class math english science teacher
1   1 1     50   98      50      kim
2   2 1     60   97      60      kim
3   3 1     45   86      78      kim
4   4 1     30   98      58      kim
5   5 2     25   80      65      lee
6   6 2     50   89      98      lee
7   7 2     80   90      45      lee
8   8 2     90   78      25      lee
9   9 3     20   98      15      park
10 10 3     50   98      45      park
11 11 3     65   65      65      park
12 12 3     45   85      32      park
13 13 4     46   98      65      choi
14 14 4     48   87      12      choi
15 15 4     75   56      78      choi
16 16 4     58   98      65      choi
17 17 5     65   68      98      jung
18 18 5     80   78      90      jung
19 19 5     89   68      87      jung
20 20 5     78   83      58      jung

In [0]:
# 세로로 합치기 
# 데이터 생성 
# 학생 1~5 번 시험 데이터 생성
group_a <- data.frame(id = c(1, 2, 3, 4, 5),                       test = c(60, 80, 70, 90, 85)) 
 
# 학생 6~10 번 시험 데이터 생성
group_b <- data.frame(id = c(6, 7, 8, 9, 10),                       test = c(70, 83, 65, 95, 80))

In [70]:
group_a

  id test
1 1  60
2 2  80
3 3  70
4 4  90
5 5  85

In [71]:
group_b

  id test
1  6 70
2  7 83
3  8 65
4  9 95
5 10 80

In [60]:
# bind_rows() 함수 이용하여 세로로 합치기
group_all <- bind_rows(group_a, group_b)  # 데이터 합쳐서 group_all 에 할당
group_all                                 # group_all 출력

   id test
1   1 60
2   2 80
3   3 70
4   4 90
5   5 85
6   6 70
7   7 83
8   8 65
9   9 95
10 10 80

## 혼자서 해보기(5)

mpg 데이터를 이용해서 분석 문제를 해결해 보세요. 
mpg 데이터의 fl 변수는 자동차에 사용하는 연료(fuel)를 의미합니다. 아래는 자동차 연료별 가격을 나타낸 표입니다. 
우선 이 정보를 이용해서 연료와 가격으로 구성된 데이터 프레임을 만들어 보세요.

In [61]:
fuel <- data.frame(fl = c("c", "d", "e", "p", "r"),
  price_fl = c(2.35, 2.38, 2.11, 2.76, 2.22),
  stringsAsFactors = F) 
fuel  # 출력

  fl price_fl
1 c  2.35
2 d  2.38
3 e  2.11
4 p  2.76
5 r  2.22

Q1. mpg 데이터에는 연료 종류를 나타낸 fl 변수는 있지만 연료 가격을 나타낸 변수는 없습니다. 위에서 만든 fuel 데이터를 이용해서 mpg 데이터에 price_fl(연료 가격) 변수를 추가하세요.

In [73]:
mpg <- as.data.frame(ggplot2::mpg)      # mpg 데이터 불러오기
mpg <- left_join(mpg, fuel, by = "fl")  # mpg 에 연료 가격 변수 추가
head(mpg)

  manufacturer model displ year cyl trans      drv cty hwy fl class   price_fl
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact 2.76
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact 2.76
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact 2.76
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact 2.76
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact 2.76
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact 2.76

Q2. 연료 가격 변수가 잘 추가됐는지 확인하기 위해서 model, fl, price_fl 변수를 추출해 앞부분 5 행을 출력해 보세요.

In [78]:
mpg %>%
  select(model, fl, price_fl) %>%
head(5)

  model fl price_fl
1 a4    p  2.76
2 a4    p  2.76
3 a4    p  2.76
4 a4    p  2.76
5 a4    p  2.76

## 분석 도전 
미국 동북중부 437개 지역의 인구통계 정보를 담고 있는 midwest 데이터를 사용해 데이터 분석 문제를 해결해 보세요. midwest는 ggplot2 패키지에 들어 있습니다.

- 문제 1. popadults 는 해당 지역의 성인 인구, poptotal 은 전체 인구를 나타냅니다. midwest 데이터에 '전체 인구 대비 미성년 인구 백분율' 변수를 추가하세요.

In [100]:
midwest <- as.data.frame(ggplot2::midwest)
summary(midwest)

      PID          county             state                area
 Min.   : 561   Length:437         Length:437         Min.   :0.00500
 1st Qu.: 670   Class :character   Class :character   1st Qu.:0.02400
 Median :1221   Mode  :character   Mode  :character   Median :0.03000
 Mean   :1437                                         Mean   :0.03317
 3rd Qu.:2059                                         3rd Qu.:0.03800
 Max.   :3052                                         Max.   :0.11000
    poptotal         popdensity          popwhite          popblack
 Min.   :   1701   Min.   :   85.05   Min.   :    416   Min.   :      0
 1st Qu.:  18840   1st Qu.:  622.41   1st Qu.:  18630   1st Qu.:     29
 Median :  35324   Median : 1156.21   Median :  34471   Median :    201
 Mean   :  96130   Mean   : 3097.74   Mean   :  81840   Mean   :  11024
 3rd Qu.:  75651   3rd Qu.: 2330.00   3rd Qu.:  72968   3rd Qu.:   1291
 Max.   :5105067   Max.   :88018.40   Max.   :3204947   Max.   :1317147
 popamerindian        popasian         popother        percwhite
 Min.   :    4.0   Min.   :     0   Min.   :     0   Min.   :10.69
 1st Qu.:   44.0   1st Qu.:    35   1st Qu.:    20   1st Qu.:94.89
 Median :   94.0   Median :   102   Median :    66   Median :98.03
 Mean   :  343.1   Mean   :  1310   Mean   :  1613   Mean   :95.56
 3rd Qu.:  288.0   3rd Qu.:   401   3rd Qu.:   345   3rd Qu.:99.07
 Max.   :10289.0   Max.   :188565   Max.   :384119   Max.   :99.82
   percblack       percamerindan        percasian        percother
 Min.   : 0.0000   Min.   : 0.05623   Min.   :0.0000   Min.   :0.00000
 1st Qu.: 0.1157   1st Qu.: 0.15793   1st Qu.:0.1737   1st Qu.:0.09102
 Median : 0.5390   Median : 0.21502   Median :0.2972   Median :0.17844
 Mean   : 2.6763   Mean   : 0.79894   Mean   :0.4872   Mean   :0.47906
 3rd Qu.: 2.6014   3rd Qu.: 0.38362   3rd Qu.:0.5212   3rd Qu.:0.48050
 Max.   :40.2100   Max.   :89.17738   Max.   :5.0705   Max.   :7.52427
   popadults          perchsd        percollege        percprof
 Min.   :   1287   Min.   :46.91   Min.   : 7.336   Min.   : 0.5203
 1st Qu.:  12271   1st Qu.:71.33   1st Qu.:14.114   1st Qu.: 2.9980
 Median :  22188   Median :74.25   Median :16.798   Median : 3.8142
 Mean   :  60973   Mean   :73.97   Mean   :18.273   Mean   : 4.4473
 3rd Qu.:  47541   3rd Qu.:77.20   3rd Qu.:20.550   3rd Qu.: 4.9493
 Max.   :3291995   Max.   :88.90   Max.   :48.079   Max.   :20.7913
 poppovertyknown   percpovertyknown percbelowpoverty percchildbelowpovert
 Min.   :   1696   Min.   :80.90    Min.   : 2.180   Min.   : 1.919
 1st Qu.:  18364   1st Qu.:96.89    1st Qu.: 9.199   1st Qu.:11.624
 Median :  33788   Median :98.17    Median :11.822   Median :15.270
 Mean   :  93642   Mean   :97.11    Mean   :12.511   Mean   :16.447
 3rd Qu.:  72840   3rd Qu.:98.60    3rd Qu.:15.133   3rd Qu.:20.352
 Max.   :5023523   Max.   :99.86    Max.   :48.691   Max.   :64.308
 percadultpoverty percelderlypoverty    inmetro         category
 Min.   : 1.938   Min.   : 3.547     Min.   :0.0000   Length:437
 1st Qu.: 7.668   1st Qu.: 8.912     1st Qu.:0.0000   Class :character
 Median :10.008   Median :10.869     Median :0.0000   Mode  :character
 Mean   :10.919   Mean   :11.389     Mean   :0.3432
 3rd Qu.:13.182   3rd Qu.:13.412     3rd Qu.:1.0000
 Max.   :43.312   Max.   :31.162     Max.   :1.0000

In [0]:
midwest <- midwest %>% mutate(ratio_child = (poptotal-popadults)/poptotal*100)

- 문제 2. 미성년 인구 백분율이 가장 높은 상위 5 개 county(지역)의 미성년 인구 백분율을 출력하세요.

In [102]:
midwest %>%   arrange(desc(ratio_child)) %>%   
   select(county, ratio_child) %>%  
   head(5)

  county    ratio_child
1 ISABELLA  51.50117
2 MENOMINEE 50.59126
3 ATHENS    49.32073
4 MECOSTA   49.05918
5 MONROE    47.35818

- 문제 3. 분류표의 기준에 따라 미성년 비율 등급 변수를 추가하고, 각 등급에 몇 개의 지역이 있는지 알아보세요

In [0]:
midwest <- midwest %>%  
 mutate(grade = ifelse(ratio_child >= 40, "large",
                   ifelse(ratio_child >= 30, "middle", "small")))

In [104]:
table(midwest$grade)

 large middle  small
    32    396      9

- 문제4. popasian은 해당 지역의 아시아인 인구를 나타냅니다. '전체 인구 대비 아시아인 인구 백분율' 변수를 추가하고, 하위 10개 지역의 state(주), county(지역명), 아시아인 인구 백분율을 출력하세요.

In [105]:
midwest %>% 
  mutate(ratio_asian = (popasian / poptotal)*100) %>%
  arrange(ratio_asian) %>%
  select(state, county, ratio_asian) %>%
  head(10)

   state county    ratio_asian
1  WI    MENOMINEE 0.00000000
2  IN    BENTON    0.01059210
3  IN    CARROLL   0.01594981
4  OH    VINTON    0.02703190
5  WI    IRON      0.03250447
6  IL    SCOTT     0.05315379
7  IN    CLAY      0.06071645
8  MI    OSCODA    0.06375925
9  OH    PERRY     0.06654625
10 IL    PIATT     0.07074865

## 정리하기

In [0]:
# 1. 조건에 맞는 데이터만 추출하기
exam %>% filter(english >= 80) 
 
# 여러 조건 동시 충족
exam %>% filter(class == 1 & math >= 50) 
 
# 여러 조건 중 하나 이상 충족
exam %>% filter(math >= 90 | english >= 90) exam %>% filter(class %in% c(1,3,5)) 
 
 
# 2. 필요한 변수만 추출하기
exam %>% select(math) exam %>% select(class, math, english) 
 
 
# 3. 함수 조합하기 , 일부만 출력하기
exam %>%   select(id, math) %>%   head(10) 
# 4. 순서대로 정렬하기
exam %>% arrange(math)         # 오름차순 정렬
exam %>% arrange(desc(math))   # 내림차순 정렬
exam %>% arrange(class, math)  # 여러 변수 기준 오름차순 정렬
 
 
# 5. 파생변수 추가하기
exam %>% mutate(total = math + english + science) 
 
# 여러 파생변수 한 번에 추가하기
exam %>%   mutate(total = math + english + science,          mean = (math + english + science)/3) 
 
# mutate() 에 ifelse() 적용하기
exam %>% mutate(test = ifelse(science >= 60, "pass", "fail")) 
 
# 추가한 변수를 dplyr 코드에 바로 활용하기
exam %>%   mutate(total = math + english + science) %>%   arrange(total) 
# 6. 집단별로 요약하기
exam %>%   group_by(class) %>%   summarise(mean_math = mean(math)) 
 
# 각 집단별로 다시 집단 나누기
mpg %>%   group_by(manufacturer, drv) %>%   summarise(mean_cty = mean(cty)) 
 
 
# 7. 데이터 합치기
# 가로로 합치기
total <- left_join(test1, test2, by = "id") 
 
# 세로로 합치기
group_all <- bind_rows(group_a, group_b)